n=int(input())
arr = []
for _ in range(n):
    a = input("Введите любой элимент: ")
    try:
        a = int(a)
        arr.append(a)
    except ValueError:
        arr.append(a)


while True:
    zadacha = input(f"действие: \n 1: добавление элемента в конец списка \n 2: добавление элемента на определенную позицию \n 3: удаление элемента по индексу \n 4: удаление элемента по значению \n 5: размер списка \n 6: сортировка по убыванию  \n 7: сортировка по возрастанию \n 8: вывод на экран элементов списка \n нажми на другие клавиши для выхода")
#---------------------------------------------------------------
    if zadacha == '1':
        a = input()
        arr.append(a)
#-----------------------------------------------------------
    elif zadacha == '2':
        a = input()
        index = int(input())
        arr1 = arr.insert(index, a)
#----------------------------------------------------------------
    elif zadacha == '3':
        indexs = int(input("введите индекс значения которое хотите удалить: "))
        arr.pop(indexs)
#-----------------------------------------------------------
    elif zadacha == '4':
        elem = input("введите значение которое хотите удалить: ")
        arr.remove(elem)
#----------------------------------------------------------
    elif zadacha == '5':
        print(f"длина списка = {len(arr)}")
#----------------------------------------------------------FFFFFF
    elif zadacha == '6':
        arr.sort()
#---------------------------------------------------------
    elif zadacha == '7':
        arr.sort(reverse=True)
#--------------------------------------------------
    elif zadacha == '8' :
        print(arr)
#----------------------------------------------------------
    else:
        print(f"цикл после выхода был равен: {arr}")
        break